app/controllers/feeds_controller.rb

  def index
    @feeds = @popup.feeds.all
---
SELECT "feeds".* FROM "feeds"  WHERE "feeds"."popup_id" = $1  [["popup_id", 5]]

  def new
    @feed = @popup.feeds.new
    @feed = User.find(params[:user_id]).feeds.new(params[:feed])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def create
    @feed = @popup.feeds.new(feed_params)
    @feed.user_id = current_user.id
    if @feed.save
---
INSERT INTO "feeds" ("comment", "created_at", "popup_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "this is a test"], ["created_at", "2014-05-26 17:36:03.750380"], ["popup_id", 5], ["updated_at", "2014-05-26 17:36:03.750380"], ["user_id", 1]]

  def show
    @feed = @popup.feeds.find(params[:id])
---
SELECT  "feeds".* FROM "feeds"  WHERE "feeds"."popup_id" = $1 AND "feeds"."id" = $2 LIMIT 1  [["popup_id", 5], ["id", 1]]

    def destroy
    @feed = @popup.feeds.find(params[:id])
    @feed.destroy
---
SELECT  "feeds".* FROM "feeds"  WHERE "feeds"."popup_id" = $1 AND "feeds"."id" = $2 LIMIT 1  [["popup_id", 1], ["id", 5]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 5]]

  def load_popup
    @popup = Popup.find(params[:popup_id])
---
SELECT  "popups".* FROM "popups"  WHERE "popups"."id" = $1 LIMIT 1  [["id", 5]]