app/controllers/popups_controller.rb

  def index
    @popups = Popup.all
---
SELECT "popups".* FROM "popups"  WHERE (name LIKE '%%')

  def create
    @popup = Popup.create popup_params
---
INSERT INTO "popups" ("address", "created_at", "description", "hours", "image", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["address", ""], ["created_at", "2014-05-24 21:01:48.179132"], ["description", ""], ["hours", ""], ["image", ""], ["name", "tyler"], ["price", ""], ["updated_at", "2014-05-24 21:01:48.179132"]]

  def show
    @popup = Popup.find(params[:id])
    @feed_new = Feed.new
    @user = current_user
    @feeds = @popup.feeds.all
---
SELECT  "popups".* FROM "popups"  WHERE "popups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "feeds".* FROM "feeds"  WHERE "feeds"."popup_id" = $1  [["popup_id", 1]]
SELECT "popups".* FROM "popups"

  def update
    @popup = Popup.find(params[:id])
    @popup.update image_params
---
SELECT  "popups".* FROM "popups"  WHERE "popups"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "popups" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "popups"."id" = 7  [["image_file_name", "images.jpeg"], ["image_file_size", 3574], ["image_updated_at", "2014-05-28 18:32:27.289018"], ["updated_at", "2014-05-28 18:32:28.308311"]]