app/controllers/popups_controller.rb

  def index
    @popups = Popup.search_for(params[:q]).where(active: true)
---
SELECT "popups".* FROM "popups"  WHERE (name LIKE '%%') AND "popups"."active" = 't'